////////////////////////////////задание 1///////////////////////////
document.write('<br> Задание 1 <br>');
document.write('<br> С помощью цикла while вывести все простые числа в промежутке от 0 до 100. <br>');

var max = 100;
var a = []; //массив простых чисел
var i = 1; //начало счетчика, начинаем с 2, первое простое число
var split = 0;
a[0] = 1; //первое простое число

while (i <= max) {
    split = 0;
    for (var count = 0; count <= a.length - 1; count++) {
        //исключим 1 и число делящееся само на себя
        if ((i % a[count] == 0) && a[count] != i && a[count] != 1) {
            split = 1;
            break; //есть делитель, число не простое
        }
    }

    if (split == 0) {
        document.write(i);
        document.write(',')
        a.push(i); //Добавляем простое число
    }

    i = i + 1;
}
